import re
import requests

html_url = 'https://match.yuanrenxue.com/match/7'
headers = {
    'user-agent': 'yuanrenxue.project'
}
resp = requests.get(html_url, headers=headers).text
print(resp)
names = re.findall(r"name=\[(.*?)\];", resp, re.S)
names = names[0].replace("\'", '').split(',')
print(names, len(names))
l = ['极镀ギ紬荕','爷灬霸气傀儡','梦战苍穹','傲世哥','мaη肆風聲','一刀メ隔世','横刀メ绝杀','Q不死你R死你','魔帝殤邪','封刀不再战','倾城孤狼','戎马江湖','狂得像风','影之哀伤','謸氕づ独尊','傲视狂杀','追风之梦','枭雄在世','傲视之巅','黑夜刺客','占你心为王','爷来取你狗命','御风踏血','凫矢暮城','孤影メ残刀','野区霸王','噬血啸月','风逝无迹','帅的睡不着','血色杀戮者','冷视天下','帅出新高度','風狆瑬蒗','灵魂禁锢','ヤ地狱篮枫ゞ','溅血メ破天','剑尊メ杀戮','塞外う飛龍','哥‘K纯帅','逆風祈雨','恣意踏江山','望断、天涯路','地獄惡灵','疯狂メ孽杀','寂月灭影','骚年霸称帝王','狂杀メ无赦','死灵的哀伤','撩妹界扛把子','霸刀☆藐视天下','潇洒又能打','狂卩龙灬巅丷峰','羁旅天涯.','南宫沐风','风恋绝尘','剑下孤魂','一蓑烟雨','领域★倾战','威龙丶断魂神狙','辉煌战绩','屎来运赚','伱、Bu够档次','九音引魂箫','骨子里的傲气','霸海断长空','没枪也很狂','死魂★之灵']
print(len(l))
